{
  "areaId": "CMS001",
  "areaName": "The Wailing Cornfields",
  "areaType": "mixed",
  "areaDescription": "Endless walls of tall, rustling stalks form a shifting labyrinth across the land, where whispered cries ride the night wind and unseen things brush against wanderers in the gloom. Travelers who stray from the narrow dirt paths report disorienting echoes and sudden, chilling gusts that hint at the fields' haunted reputation.",
  "dangerLevel": "medium",
  "recommendedLevel": 2,
  "climate": "varied",
  "terrain": "varied terrain",
  "map": {
    "mapId": "MAP_C_6",
    "mapName": "Mixed Map",
    "totalRooms": 6,
    "rooms": [
      {
        "id": "C01",
        "type": "room",
        "connections": [
          "C02",
          "C03"
        ],
        "coordinates": "X2Y2",
        "directions": {
          "east": "C02",
          "south": "C03"
        },
        "tags": [],
        "purpose": "unknown",
        "landmark": false,
        "dangerLevel": "medium",
        "name": "Shrouded Stalk Maze"
      },
      {
        "id": "C02",
        "type": "room",
        "connections": [
          "C01",
          "C05"
        ],
        "coordinates": "X3Y2",
        "directions": {
          "west": "C01",
          "north": "C05"
        },
        "tags": [],
        "purpose": "unknown",
        "landmark": true,
        "dangerLevel": "medium",
        "name": "Withered Scarecrow Watch"
      },
      {
        "id": "C03",
        "type": "room",
        "connections": [
          "C01",
          "C04",
          "C06"
        ],
        "coordinates": "X2Y3",
        "directions": {
          "north": "C01",
          "south": "C04",
          "west": "C06"
        },
        "tags": [],
        "purpose": "unknown",
        "landmark": false,
        "dangerLevel": "medium",
        "name": "Harvest Moon Clearing"
      },
      {
        "id": "C04",
        "type": "room",
        "connections": [
          "C03"
        ],
        "coordinates": "X2Y4",
        "directions": {
          "north": "C03"
        },
        "tags": [
          "dead_end"
        ],
        "purpose": "unknown",
        "landmark": true,
        "dangerLevel": "medium",
        "name": "Cornhusk Dead End"
      },
      {
        "id": "C05",
        "type": "room",
        "connections": [
          "C02"
        ],
        "coordinates": "X3Y1",
        "directions": {
          "south": "C02"
        },
        "tags": [
          "dead_end"
        ],
        "purpose": "unknown",
        "landmark": true,
        "dangerLevel": "medium",
        "name": "Sinkhole Furrow"
      },
      {
        "id": "C06",
        "type": "room",
        "connections": [
          "C03"
        ],
        "coordinates": "X1Y3",
        "directions": {
          "east": "C03"
        },
        "tags": [
          "dead_end"
        ],
        "purpose": "unknown",
        "landmark": true,
        "dangerLevel": "medium",
        "name": "The Lost Child Hollow"
      }
    ],
    "layout": [
      [
        "   ",
        "   ",
        "C05"
      ],
      [
        "   ",
        "C01",
        "C02"
      ],
      [
        "C06",
        "C03",
        "   "
      ],
      [
        "   ",
        "C04",
        "   "
      ]
    ],
    "startRoom": "C01",
    "version": "1.1",
    "notes": "Extended schema with AI-friendly navigation fields"
  },
  "locations": [
    {
      "locationId": "C01",
      "name": "Shrouded Stalk Maze",
      "type": "room",
      "description": "Thick, towering corn walls muffle all but the wind's mournful sighs. Stalks twist at odd angles, some splattered with faded stains, and the ground is littered with snapped husks crunching beneath each step. Narrow, winding lanes seem to shift when unobserved, and every so often, a chill gust carries a distant, pleading whisper.",
      "coordinates": "X2Y2",
      "connectivity": [
        "C02",
        "C03"
      ],
      "areaConnectivity": [
        "Fields of Supplication"
      ],
      "areaConnectivityId": [
        "D04"
      ],
      "npcs": [],
      "monsters": [
        {
          "name": "Cornfield Shadow",
          "description": "A twisted shadowy figure, resembling a child-sized scarecrow, occasionally flickers between the stalks. It attacks with cold, grasping hands if the party lingers too long or makes too much noise."
        }
      ],
      "lootTable": [
        "Antique silver locket (containing a faded family portrait)",
        "1 dose Witch-hazel Poultice (restores 1d4 HP, once)",
        "Corn Maiden's Sigil Token (grants advantage on one Wisdom saving throw against fear in this area)"
      ],
      "plotHooks": [
        "A set of muddy, small footprints diverges from the path, hinting someone (perhaps a missing child) is deeper within the maze.",
        "A torn piece of orange cloth is snagged on a stalk, matching festival garb from the Harvest Festival Green."
      ],
      "dmInstructions": "Describe the unsettling, shifting quality of the maze. Play up the sense of being watched. Use the Cornfield Shadow as a low-level ambush or to drive the party deeper. Clues here should foreshadow missing villagers or children without revealing key NPCs yet. On combat encounter: Call createEncounter with Cornfield Shadow (50 XP). XP is automatically awarded when encounter ends.",
      "doors": [],
      "traps": [
        {
          "detectDC": 13,
          "disableDC": 14,
          "triggerDC": 10,
          "damage": "1d6 slashing (hidden sickle-blade buried in a row, activated by tripwire)"
        }
      ],
      "dcChecks": [
        "Perception DC 12: Notice the muddy footprints or torn cloth.",
        "Survival DC 13: Determine the most-trodden path through the maze.",
        "Investigation DC 14: Find the faintly glowing sigil token buried beneath loose husks."
      ],
      "accessibility": "Normal access from the maze entrance; vision is limited to a few feet in all directions.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Signs Of Age",
          "description": "Stalks here are dry, brittle, with some blackened by age or strange blight. The ground is uneven and eroded."
        },
        {
          "name": "Muffled Whispers",
          "description": "Indiscernible voices on the wind, growing louder the longer one remains."
        }
      ],
      "encounters": [
        {
          "type": "combat",
          "description": "Cornfield Shadow ambush if party is loud or rests here."
        },
        {
          "type": "exploration",
          "description": "Hidden token and clues to other missing villagers."
        }
      ],
      "adventureSummary": "A confusing, shifting entry to the haunted fields, with threats both seen and unseen."
    },
    {
      "locationId": "C02",
      "name": "Withered Scarecrow Watch",
      "type": "room",
      "description": "Rows of leaning, worm-eaten posts bear half-collapsed scarecrows—each draped in tattered rags and crowned with moldy gourd heads. The ground is sticky with sap and old blood, and a sense of watchfulness pervades. One scarecrow stands fresher than the others, its stitched grin impossibly wide.",
      "coordinates": "X3Y2",
      "connectivity": [
        "C01",
        "C05"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [
        {
          "name": "Animated Scarecrow",
          "description": "A scarecrow animated by twisted magic, defending its post if disturbed by intruders."
        }
      ],
      "lootTable": [
        "Two sprigs of blessed yarrow (advantage vs. charm or fear once)",
        "Crone's Charm: Tiny fetish granting +1 to Insight checks in the cornfields",
        "Handwritten note: Fragment of a ritual to repel 'the Gourd-Lord'"
      ],
      "plotHooks": [
        "A torn piece of orange cloth is snagged on a nearby scarecrow, matching festival garb from Greenfields Vale.",
        "Strange runes carved on scarecrow posts match those seen at other cursed sites in the region."
      ],
      "dmInstructions": "This area serves as a waypoint through the cornfields. The Animated Scarecrow defends its post if disturbed. The torn cloth and runic carvings provide clues linking this location to the broader curse affecting the region. On combat encounter: Call createEncounter with Animated Scarecrow (100 XP). For significant roleplay outcomes: Call updateCharacterInfo for gained items/abilities. XP is automatically awarded when encounter ends.",
      "doors": [],
      "traps": [],
      "dcChecks": [
        "Investigation DC 13: Notice the torn cloth matches festival garb from Greenfields Vale.",
        "Arcana DC 14: Analyze the runic carvings to glean insight about the curse.",
        "Perception DC 12: Spot additional hidden runes carved into scarecrow posts."
      ],
      "accessibility": "Normal access, but the area feels exposed—eyes on the party from every angle.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Interesting Architecture",
          "description": "Each scarecrow is unique, crafted with personal trinkets and odd tokens in their clothing."
        },
        {
          "name": "Dust",
          "description": "Thick motes drift in the air, disturbed by the slightest breeze or movement."
        }
      ],
      "encounters": [
        {
          "type": "roleplay",
          "description": "A crow with a broken ribbon around its leg delivers a rhyme from Old Crone Willa, hinting at a relic in the barn."
        }
      ],
      "adventureSummary": "A crossroads of superstition and defense, offering both danger and vital information if players are diplomatic."
    },
    {
      "locationId": "C03",
      "name": "Harvest Moon Clearing",
      "type": "room",
      "description": "A wide, moonlit glade at the heart of the corn, ringed by toppled bundles and rotting pumpkins. The full harvest moon casts twisting shadows, and the ground is covered in strange runes drawn in ash. In the center: a crude effigy, arms outstretched, headless.",
      "coordinates": "X2Y3",
      "connectivity": [
        "C01",
        "C04",
        "C06"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Widow Grella & Grandson Tom",
          "description": "A gaunt, desperate woman clutching her trembling, mute grandson. Grella is frantic, convinced the Pumpkin King seeks Tom as a 'harvest tithe'.",
          "attitude": "Pleading, fearful, and desperate—will beg the party for help or try to hide if threatened."
        },
        {
          "name": "Morwenna Hollowell",
          "description": "Human Warlock, female, Afro-Caribbean heritage. Lean, with deep brown skin, braided silver-threaded hair, and eyes that glint like obsidian. She wears crow feathers tied to her sleeves and carries a charm-string of bones. If the player speaks to her respectfully in the corn maze, she quietly declares she will join them, 'strength in numbers against what stirs.'",
          "attitude": "Brooding and intense; claims the corn whispers secrets, and sometimes she whispers back."
        }
      ],
      "monsters": [
        {
          "name": "Rune-Scarred Vermin (Swarm of Rats)",
          "description": "Rats twisted by magic, covered in faint glowing runes, emerge from the pumpkin mounds if the effigy is disturbed."
        },
        {
          "name": "Straw Husk",
          "description": "Animate bundles of dried corn stalks bound together with black twine, moving with jerky, unnatural motions. Their hollow eye sockets glow with orange light, and they attack with sharp, whip-like appendages."
        },
        {
          "name": "Straw Husk",
          "description": "Animate bundles of dried corn stalks bound together with black twine, moving with jerky, unnatural motions. Their hollow eye sockets glow with orange light, and they attack with sharp, whip-like appendages."
        },
        {
          "name": "Straw Husk",
          "description": "Animate bundles of dried corn stalks bound together with black twine, moving with jerky, unnatural motions. Their hollow eye sockets glow with orange light, and they attack with sharp, whip-like appendages."
        }
      ],
      "lootTable": [
        "Carved wooden whistle (summons nearby crows, once)",
        "Bundle of dried witchgrass (can be burned to ward off spectral threats for 10 minutes)",
        "Harvest Moon Medallion (protection from necrotic damage, one use)"
      ],
      "plotHooks": [
        "Grella describes seeing 'the Pumpkin King's shadow' headed toward the Barn of Offerings, dragging something large.",
        "Cryptic runes describe a binding ritual, missing a final element—Grella believes only the priest from Harvest Festival Green would know more."
      ],
      "dmInstructions": "When moon appears: Call createEncounter with 2-3 Straw Husks (50 XP each).",
      "doors": [],
      "traps": [
        {
          "detectDC": 11,
          "disableDC": 13,
          "triggerDC": 0,
          "damage": "None—disturbing the effigy awakens the rat swarm, which attacks immediately."
        }
      ],
      "dcChecks": [
        "Medicine DC 12: Soothe Tom or diagnose his muteness is from fright.",
        "Arcana DC 15: Decipher the runes' meaning and connection to the curse.",
        "Animal Handling DC 12: Use the whistle to summon crows as a distraction against the rats."
      ],
      "accessibility": "Normal access; the clearing is obvious once found, though entering is intimidating.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Dust",
          "description": "Ash and pollen float in the moonlight, disturbed with every step."
        },
        {
          "name": "Interesting Architecture",
          "description": "The effigy is made of bundled corn stalks and bones, missing its head."
        }
      ],
      "encounters": [
        {
          "type": "roleplay",
          "description": "Aid or question Widow Grella and Tom."
        },
        {
          "type": "combat",
          "description": "Rat swarm if the effigy is tampered with; Straw Husks if combat is prolonged."
        },
        {
          "type": "exploration",
          "description": "Study the runes for ritual clues."
        }
      ],
      "adventureSummary": "A pivotal location for rescuing NPCs, learning more about the curse and the Pumpkin King's next move."
    },
    {
      "locationId": "C04",
      "name": "Cornhusk Dead End",
      "type": "room",
      "description": "A claustrophobic, narrow alley of stalks ends abruptly at a heap of moldy husks and broken tools. The air is thick with the scent of rot. Strange sigils, burned into the ground, pulse with faint orange light. Here, the veil between worlds is thin, and the wailing grows loudest.",
      "coordinates": "X2Y4",
      "connectivity": [
        "C03"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [],
      "monsters": [],
      "lootTable": [
        "A silver sickle (damages spectral entities, glows faintly near undead)",
        "Torn page from a priest's journal—details about the Pumpkin King's origin",
        "Burlap pouch with dried nightshade berries (poisonous, but useful for some rituals)"
      ],
      "plotHooks": [
        "The glowing sigils whisper warnings about the Pumpkin King's power and the need to find the Old Graveyard.",
        "The journal page connects the sigils to a failed protection ritual performed by the village priest and mentions the Gallows Oak."
      ],
      "dmInstructions": "Play up the supernatural dread here. The sigils pulse with dark energy and whisper warnings about the Pumpkin King's hunger. Investigation DC 15 reveals clues about the graveyard location. The silver sickle and journal page are critical loot for later encounters.",
      "doors": [],
      "traps": [
        {
          "detectDC": 15,
          "disableDC": 15,
          "triggerDC": 13,
          "damage": "1d8 necrotic (glyphs pulse, releasing a wave of chilling force upon tampering)"
        }
      ],
      "dcChecks": [
        "Religion DC 14: Identify the sigils as failed wards against undead.",
        "Persuasion DC 15: Convince the Wraith to answer questions before it attacks.",
        "Investigation DC 12: Locate the priest's torn journal page beneath the husks."
      ],
      "accessibility": "Normal access, though the path is increasingly overgrown and oppressive.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Dust",
          "description": "Fine, ashen dust covers everything, stirring in choking clouds as you move."
        },
        {
          "name": "Signs Of Age",
          "description": "Heaps of broken, rusted farm implements, overgrown with moldy husks."
        }
      ],
      "encounters": [
        {
          "type": "combat",
          "description": "Noose Wraith attacks if disturbed or not appeased."
        },
        {
          "type": "exploration",
          "description": "Search for the hidden journal page and silver sickle among the debris."
        }
      ],
      "adventureSummary": "The haunted heart of the Wailing Cornfields, where dangerous knowledge and vengeful spirits linger near the edge of the mortal world."
    },
    {
      "locationId": "C05",
      "name": "Sinkhole Furrow",
      "type": "room",
      "description": "A deep depression in the earth where the cornfield has collapsed into a natural sinkhole, revealing ancient stone foundations beneath. Twisted corn stalks grow at unnatural angles around the rim, and strange phosphorescent fungi illuminate the depths with an eerie green glow. The air here is thick and oppressive, filled with the sound of dripping water and distant moaning.",
      "coordinates": "X3Y1",
      "connectivity": [
        "C02"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Echo of the Lost Farmer",
          "description": "A ghostly apparition of a farmer who fell into the sinkhole decades ago, still trying to tend his crops. The spirit is confused and disoriented, repeating fragments of agricultural advice and warnings about 'the hungry earth'.",
          "attitude": "Neutral but melancholy; will answer questions if treated with respect, but becomes agitated if ignored or mocked."
        },
        {
          "name": "Elric Dawlish",
          "description": "Half-Elf Rogue [Apprentice], male, adolescent. Slight and wiry, with auburn hair that hides his pointed ears. Wears tattered orange festival garb and a cracked porcelain mask he never removes. Keeps a dagger clenched too tightly in his hand. If rescued from danger in the maze and spoken to, he insists on staying close and 'learning how to be brave.'",
          "attitude": "Skittish but eager to prove himself; copies the player's mannerisms."
        }
      ],
      "monsters": [
        {
          "name": "Blight Tendril",
          "description": "Corrupted root systems that have grown sentient, emerging from the sinkhole walls to ensnare the living. They pulse with the same green phosphorescence as the fungi."
        }
      ],
      "lootTable": [
        "Ancient farming tool (works as a +1 improvised weapon against plant creatures)",
        "Vial of phosphorescent sap (glows for 8 hours, can be used as a marking substance)",
        "Stone tablet fragment (contains partial agricultural blessing in ancient script)"
      ],
      "plotHooks": [
        "The Echo warns that 'the hungry earth drinks deep when the moon is full,' suggesting a connection to the harvest rituals.",
        "Strange runes carved into the ancient foundations match those seen elsewhere in the cornfields, indicating this was once a sacred site."
      ],
      "dmInstructions": "On entry: Prompt for Perception DC 12. On fail: Trigger trap - prompt for STR save DC 12 or restrained + 1d6 damage/round. On combat encounter: Call createEncounter with Blight Tendril (100 XP). For significant roleplay outcomes: Call updateCharacterInfo for gained items/abilities. XP is automatically awarded when encounter ends.",
      "doors": [],
      "traps": [
        {
          "detectDC": 14,
          "disableDC": 16,
          "triggerDC": 12,
          "damage": "1d8 bludgeoning + grappled (unstable ground near the rim collapses if too much weight is placed on it)"
        }
      ],
      "dcChecks": [
        "History DC 13: Recognize the ancient foundations as pre-dating the current settlement.",
        "Nature DC 12: Identify the phosphorescent fungi as feeding on necrotic energy.",
        "Investigation DC 15: Decipher the partial runes on the stone foundations."
      ],
      "accessibility": "Dangerous to approach; the rim is unstable and climbing down requires rope or climbing gear.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Ancient Foundations",
          "description": "Weathered stone blocks covered in moss and strange runes, remnants of some forgotten structure."
        },
        {
          "name": "Phosphorescent Fungi",
          "description": "Glowing green mushrooms that provide dim illumination but pulse faster when danger approaches."
        },
        {
          "name": "Unstable Rim",
          "description": "The edge of the sinkhole is cracked and crumbling, threatening to give way under weight."
        }
      ],
      "encounters": [
        {
          "type": "roleplay",
          "description": "Conversation with the Echo of the Lost Farmer about the site's history."
        },
        {
          "type": "combat",
          "description": "Blight Tendrils emerge if the party disturbs the fungi or descends into the sinkhole."
        },
        {
          "type": "exploration",
          "description": "Investigating the ancient foundations and deciphering the runes."
        }
      ],
      "adventureSummary": "A dangerous excavation site that reveals the ancient origins of the curse and provides historical context through its ghostly guardian."
    },
    {
      "locationId": "C06",
      "name": "The Lost Child Hollow",
      "type": "room",
      "description": "A small clearing surrounded by unusually tall corn stalks that bend inward like a natural cathedral. At the center lies a child's makeshift shelter—a lean-to of broken boards and torn festival cloth, surrounded by carved wooden toys and wilted flowers. The air is filled with the faint sound of sobbing, though no child can be seen. Fresh footprints in the soft earth suggest recent habitation.",
      "coordinates": "X1Y3",
      "connectivity": [
        "C03"
      ],
      "areaConnectivity": [],
      "areaConnectivityId": [],
      "npcs": [
        {
          "name": "Little Meg (Ghost Child)",
          "description": "The spirit of a young girl who became lost in the cornfields during a previous harvest festival. She appears only to those who show kindness and speaks in whispers about the 'tall man with the pumpkin head' who visits her hollow.",
          "attitude": "Shy and frightened but curious about visitors; will trust those who offer toys or treats, but flees if threatened."
        }
      ],
      "monsters": [
        {
          "name": "Protective Shadow",
          "description": "A dark, maternal presence that manifests if Little Meg feels threatened. It appears as a larger shadow that attempts to shield the child spirit from harm, attacking with cold, draining touch."
        }
      ],
      "lootTable": [
        "Child's carved wooden doll (radiates faint protective magic when held)",
        "Pressed flower bookmark (contains a simple blessing written in childish handwriting)",
        "Small pouch of candy (still fresh despite being here for years; restores 1 HP when eaten)"
      ],
      "plotHooks": [
        "Little Meg describes seeing 'the tall man' heading toward the 'place with all the crosses,' pointing toward what might be the Old Graveyard.",
        "She mentions other lost children who 'went to sleep in the ground' but promises they're 'just hiding until the bad man goes away.'"
      ],
      "dmInstructions": "If party is loud: Call createEncounter with 2 Twig Blights (25 XP each). For calming Elric: Prompt for Persuasion DC 10.",
      "doors": [],
      "traps": [],
      "dcChecks": [
        "Insight DC 10: Realize Little Meg is a spirit, not a living child.",
        "Persuasion DC 12: Convince Meg to share information about the 'tall man.'",
        "Investigation DC 11: Notice the footprints are too old to be from a living child."
      ],
      "accessibility": "Hidden entrance through the corn requires a Perception check (DC 13) to find; once found, easily accessible.",
      "dangerLevel": "Medium",
      "features": [
        {
          "name": "Makeshift Shelter",
          "description": "A child's crude lean-to decorated with festival ribbons and surrounded by simple toys."
        },
        {
          "name": "Toy Collection",
          "description": "Carved wooden animals and dolls, some clearly handmade, others store-bought from past festivals."
        },
        {
          "name": "Flower Garden",
          "description": "A small patch where wildflowers have been carefully tended, though most are now wilted."
        }
      ],
      "encounters": [
        {
          "type": "roleplay",
          "description": "Gentle interaction with Little Meg's spirit, learning about the Pumpkin King's activities."
        },
        {
          "type": "combat",
          "description": "Protective Shadow manifests if Meg feels threatened or if violence is attempted."
        },
        {
          "type": "exploration",
          "description": "Searching the hollow for clues about other missing children and the curse's history."
        }
      ],
      "adventureSummary": "A touching encounter with an innocent victim of the curse that provides valuable intelligence while emphasizing the human cost of the supernatural threat."
    }
  ],
  "randomEncounters": [
    {
      "roll": "1-15",
      "encounter": "2-3 Straw Husks",
      "description": "Animate bundles of dried corn stalks bound with black twine patrol the paths, their hollow eye sockets glowing orange. They attack with sharp, whip-like appendages and attempt to drag victims into the maze.",
      "chance": "15%",
      "dmInstructions": "Call createEncounter with 2-3 Straw Husks (50 XP each). These can be triggered during any movement between locations, especially when party makes noise or uses light sources."
    },
    {
      "roll": "16-30",
      "encounter": "1d4+1 Stirges",
      "description": "Blood-drinking creatures resembling large mosquitoes emerge from the corn, drawn by the scent of warm-blooded creatures. They swarm and attempt to attach to drain blood.",
      "chance": "15%",
      "dmInstructions": "Call createEncounter with 1d4+1 Stirges (25 XP each). Emphasize their blood-draining attachment attacks. Can occur when party rests or moves slowly through the fields."
    },
    {
      "roll": "31-45",
      "encounter": "2 Shadows",
      "description": "Dark, incorporeal undead glide between the corn stalks, their presence causing temperatures to drop noticeably. They seek to drain the strength and life force from living creatures.",
      "chance": "15%",
      "dmInstructions": "Call createEncounter with 2 Shadows (50 XP each). Remind players about strength-draining attacks. Most likely to appear during exploration or when party lingers in one area."
    },
    {
      "roll": "46-55",
      "encounter": "Cornfield Phantom",
      "description": "A ghostly figure of a lost child or farmer flickers between the stalks, calling for help but leading travelers deeper into danger. May be hostile or merely lost.",
      "chance": "10%",
      "dmInstructions": "Roleplay encounter - party can attempt to help (Persuasion DC 13) or ignore. If helped, phantom provides warning about upcoming danger. If ignored or attacked, becomes hostile spirit."
    },
    {
      "roll": "56-65",
      "encounter": "Cursed Scarecrow",
      "description": "An animated scarecrow with glowing pumpkin head stands motionless until approached, then attacks with supernatural fury. Its presence indicates the party is nearing a significant location.",
      "chance": "10%",
      "dmInstructions": "Call createEncounter with 1 Animated Scarecrow (100 XP). This encounter indicates party is close to an important location or clue."
    },
    {
      "roll": "66-75",
      "encounter": "Maze Shift",
      "description": "The corn paths magically rearrange themselves, disorienting travelers and potentially separating party members. A navigation challenge rather than combat.",
      "chance": "10%",
      "dmInstructions": "Skill challenge: Survival DC 15 or Perception DC 13 to avoid getting lost. Failure means party takes 1 hour longer to reach destination or becomes separated (individual Navigation checks to reunite)."
    },
    {
      "roll": "76-85",
      "encounter": "Whispers in the Corn",
      "description": "Eerie voices call out from deep within the maze, speaking the names of missing villagers or making ominous predictions. Psychological rather than physical threat.",
      "chance": "10%",
      "dmInstructions": "Wisdom save DC 12 or become charmed to investigate whispers. Can lead to other encounters or clues about missing villagers. No XP but provides narrative hooks."
    },
    {
      "roll": "86-95",
      "encounter": "Hidden Cache",
      "description": "A concealed stash left by previous travelers or victims contains supplies and potentially valuable information about the curse or safe passages.",
      "chance": "10%",
      "dmInstructions": "Investigation DC 14 to find cache. Contains 1d4 healing potions, 50 ft rope, and either a map of safe paths (+2 to next navigation check) or journal entries about the curse."
    },
    {
      "roll": "96-100",
      "encounter": "Harvest Moon Event",
      "description": "Under the light of the harvest moon (or its phantom), the corn maze becomes especially active. Multiple weak enemies appear but can be avoided with stealth.",
      "chance": "5%",
      "dmInstructions": "If moon visible: Call createEncounter with 1d3 Straw Husks + 1d2 Stirges (XP as normal). Party can attempt group Stealth DC 14 to avoid combat entirely. Success grants advantage on next navigation check."
    }
  ],
  "areaFeatures": [
    "bridges",
    "landmarks",
    "crossroads"
  ],
  "notes": "Balance combat, exploration, and social encounters. Transitions between areas should feel natural."
}